index.html
<!doctype html>
<html lang="en">
<head>
<title>Matthew Keezer</title>
<!-- 2016-09-20 Tue 00:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link href="https://fonts.googleapis.com/css?family=Open+Sans" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Matthew Keezer</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Websites</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.github.com/rmkeezer">Github</a>
</li>
<li><a href="https://www.linkedin.com/pub/matthew-keezer/7a/60b/454">LinkedIn</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Objective</h2>
<div class="outline-text-2" id="text-2">
<p>
To obtain a summer 2017 internship for software development that involves working on databases, intelligent
algorithms, data visualization or machine learning aimed at processing large amounts of data or enhancing
user experience.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Education</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Georgia Institute of Technology</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Atlanta, GA, USA
</p>

<p>
2014 - May 2018
</p>

<p>
Bachelor of Science
</p>

<p>
Computer Science
</p>

<p>
GPA: 3.41
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Leadership</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Software Lead Robojackets IGVC</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://github.com/RoboJackets/igvc-software">Github Repository</a>
</p>

<p>
Fall 2014-current
</p>
<ul class="org-ul">
<li>Led large software team and maintained github repository for 300lb autonomous robot
</li>
<li>Wrote framework in C++ to detect obstacles using LIDAR and cameras with computer vision techniques for detecting white lines, circles, and flags on a grassy field later combined into a point-cloud for A* path-finding
</li>
<li>Used ROS (Robot Operating System) for robot module communication, 3D simulation, and dashboard plugins
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Projects</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Undergraduate Research - Argo</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Private Gatech Repository
</p>

<p>
Fall 2015-current
</p>
<ul class="org-ul">
<li>Created webapp that lets users find relevant apps/music/media with a web-app powered using flask to combine a front-end three.js WebGL graph and back-end python that uses SQL commands to filter through the database and then process the results in order to intuitively display media to the used based on relations between the media.
</li>
<li>Designed and developed the database, created a basic GUI and visualization, and combined them using flask to produce a working three.js force-directed graph of nodes retrieved from the database.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Junior Design Project - Active Learning</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Fall 2016-current
</p>
<ul class="org-ul">
<li>Worked with a group of 5 using AGILE techniques to produce a webapp that allows professors to create and format interactive questions given to students during class who can then view their results with interactive statistics online
</li>
<li>Used MySQL, javascript, python, and flask to create a database and GUI for creating/storing interactive questions
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Mobius Tunes</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<a href="https://github.com/MountainRange/mobius-tunes">Github Repository</a>
</p>

<p>
Fall 2015 Hack GT
</p>
<ul class="org-ul">
<li>Created a python app based off of infinite jukebox where mp3 files in a playlist are analyzed at byte level using the FFT algorithm to find moments in the songs can be broken apart and stitched together to create an infinite song
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">Trip Planner Webapp</h3>
<div class="outline-text-3" id="text-5-4">
<p>
<a href="https://github.com/rmkeezer/Trip-Planner">Github Repository</a>
</p>

<p>
Summer 2016
</p>
<ul class="org-ul">
<li>Created a flask website using MySQL, python, and javascript in order to display mock data on a mock website
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">ML Clustering Analysis</h3>
<div class="outline-text-3" id="text-5-5">
<p>
<a href="https://github.com/rmkeezer/Clustering-Analysis">Github Repository</a>
</p>

<p>
Summer 2015
</p>
<ul class="org-ul">
<li>Performed unsupervised clustering analysis on the past 5 years of the fortune 500 companies using yahoo stocks
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6">Twitter Sentiment Analysis</h3>
<div class="outline-text-3" id="text-5-6">
<p>
<a href="https://github.com/rmkeezer/Twitter-Sentiment-Analysis">Github Repository</a>
</p>

<p>
Summer 2016
</p>
<ul class="org-ul">
<li>Analyzed and plotted two or more hashtags and rated which had more positive words or negative words.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7">MULE Software Development Project</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<a href="https://github.com/MountainRange/MULE">Github Repository</a>
</p>

<p>
Fall 2015
</p>
<ul class="org-ul">
<li>Used AGILE development with a team of 5 throughout a semester to recreate an old Atari game in JavaFX
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Experience</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Intern - Lab Engineer</h3>
<div class="outline-text-3" id="text-6-1">
<p>
06/2015 to 08/2015
</p>

<p>
Ericsson
</p>

<p>
Duluth, GA
</p>
<ul class="org-ul">
<li>Deployed and maintained telecom software onto client servers and databases
</li>
<li>Worked in the lab on servers remotely and on-site which involved creating hosts and worker nodes for software such as a mobile application that uses audio fingerprinting to interface with TV streams.
</li>
<li>Worked with bash scripting and d3.js to create a log scraper that visualizes incoming bit rates
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Intern - Web Developer</h3>
<div class="outline-text-3" id="text-6-2">
<p>
09/2013 to 02/2014
</p>

<p>
ResiliEnt Business Solutions
</p>

<p>
Alpharetta, GA
</p>
<ul class="org-ul">
<li>Created and completed a business website for a client using wordpress, MySQL, ftp
</li>
<li>Edited back-end Javascript and CSS files to revamp the look and feel of the template design
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Skills</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">C++</h3>
<div class="outline-text-3" id="text-7-1">
</div><div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1">Projects</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li><a href="https://github.com/RoboJackets/igvc-software">Software Lead Robojackets IGVC</a> (Fall 2014-current)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Python</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1">Classes</h4>
<div class="outline-text-4" id="text-7-2-1">
<ul class="org-ul">
<li>Machine Learning
</li>
<li>Databases
</li>
<li>Intro to AI
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2">Projects</h4>
<div class="outline-text-4" id="text-7-2-2">
<ul class="org-ul">
<li>Undergraduate Research - Argo (Fall 2015-current)
</li>
<li><a href="https://github.com/MountainRange/mobius-tunes">Mobius Tunes</a> (Fall 2015 Hack GT)
</li>
<li><a href="https://github.com/rmkeezer/Trip-Planner">Trip Planner Webapp</a> (Summer 2016)
</li>
<li>Junior Design Project - Active Learning (Fall 2016-current)
</li>
<li><a href="https://github.com/rmkeezer/Twitter-Sentiment-Analysis">Twitter Sentiment Analysis</a> (Summer 2016)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Java</h3>
<div class="outline-text-3" id="text-7-3">
</div><div id="outline-container-sec-7-3-1" class="outline-4">
<h4 id="sec-7-3-1">Classes</h4>
<div class="outline-text-4" id="text-7-3-1">
<ul class="org-ul">
<li>Intro to Java
</li>
<li>Datastructures and Algorithms
</li>
<li>Software Development
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-3-2" class="outline-4">
<h4 id="sec-7-3-2">Projects</h4>
<div class="outline-text-4" id="text-7-3-2">
<ul class="org-ul">
<li><a href="https://github.com/MountainRange/MULE">MULE Software Development Project</a> (Fall 2015)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">Databases (MySQL/SQLite)</h3>
<div class="outline-text-3" id="text-7-4">
</div><div id="outline-container-sec-7-4-1" class="outline-4">
<h4 id="sec-7-4-1">Classes</h4>
<div class="outline-text-4" id="text-7-4-1">
<ul class="org-ul">
<li>Databases
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-4-2" class="outline-4">
<h4 id="sec-7-4-2">Projects</h4>
<div class="outline-text-4" id="text-7-4-2">
<ul class="org-ul">
<li>Undergraduate Research - Argo (Fall 2015-current)
</li>
<li><a href="https://github.com/rmkeezer/Trip-Planner">Trip Planner Webapp</a> (Summer 2016)
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5">Machine Learnine</h3>
<div class="outline-text-3" id="text-7-5">
</div><div id="outline-container-sec-7-5-1" class="outline-4">
<h4 id="sec-7-5-1">Classes</h4>
<div class="outline-text-4" id="text-7-5-1">
<ul class="org-ul">
<li>Machine Learning
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-5-2" class="outline-4">
<h4 id="sec-7-5-2">Projects</h4>
<div class="outline-text-4" id="text-7-5-2">
<ul class="org-ul">
<li><a href="https://github.com/rmkeezer/Clustering-Analysis">Clustering Analysis using scikit-learn</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6">Web Scraping</h3>
<div class="outline-text-3" id="text-7-6">
</div><div id="outline-container-sec-7-6-1" class="outline-4">
<h4 id="sec-7-6-1">Projects</h4>
<div class="outline-text-4" id="text-7-6-1">
<ul class="org-ul">
<li>Undergraduate Research - Argo (Fall 2015-current)
</li>
</ul>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Websites</a></li>
<li><a href="#sec-2">Objective</a></li>
<li><a href="#sec-3">Education</a>
<ul class="nav">
<li><a href="#sec-3-1">Georgia Institute of Technology</a></li>
</ul>
</li>
<li><a href="#sec-4">Leadership</a>
<ul class="nav">
<li><a href="#sec-4-1">Software Lead Robojackets IGVC</a></li>
</ul>
</li>
<li><a href="#sec-5">Projects</a>
<ul class="nav">
<li><a href="#sec-5-1">Undergraduate Research - Argo</a></li>
<li><a href="#sec-5-2">Junior Design Project - Active Learning</a></li>
<li><a href="#sec-5-3">Mobius Tunes</a></li>
<li><a href="#sec-5-4">Trip Planner Webapp</a></li>
<li><a href="#sec-5-5">ML Clustering Analysis</a></li>
<li><a href="#sec-5-6">Twitter Sentiment Analysis</a></li>
<li><a href="#sec-5-7">MULE Software Development Project</a></li>
</ul>
</li>
<li><a href="#sec-6">Experience</a>
<ul class="nav">
<li><a href="#sec-6-1">Intern - Lab Engineer</a></li>
<li><a href="#sec-6-2">Intern - Web Developer</a></li>
</ul>
</li>
<li><a href="#sec-7">Skills</a>
<ul class="nav">
<li><a href="#sec-7-1">C++</a></li>
<li><a href="#sec-7-2">Python</a></li>
<li><a href="#sec-7-3">Java</a></li>
<li><a href="#sec-7-4">Databases (MySQL/SQLite)</a></li>
<li><a href="#sec-7-5">Machine Learnine</a></li>
<li><a href="#sec-7-6">Web Scraping</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">

<div>
<p class="author">Author: </p>
<p class="date">Updated: 2016-09-20 Tue 00:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
